[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "nickname": "Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://img.freepik.com/free-vector/bike-guy-wattpad-book-cover_23-2149452163.jpg?w=740&t=st=1711389222~exp=1711389822~hmac=9d3ed19c7c012bc9537430fe50a877bd5fa2ec496c3f7cc3d823078c5af33e0d",
    "review": "A timeless classic exploring the decadence and disillusionment of the American Dream. Fitzgerald's vivid prose paints a poignant picture of a society engulfed in excess and moral decay, while his characters, particularly the enigmatic Jay Gatsby, resonate with depth and complexity. This novel serves as a compelling meditation on the elusive nature of happiness and the corrosive effects of obsession, offering profound insights into the human condition.",
    "totalPages": 420,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classics", "Romance", "Tragedy"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925,
    "identity": "Adult"
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "nickname": "Mockingbird",
    "author": "Harper Lee",
    "image": "https://images.unsplash.com/photo-1698195811212-2cdb4a0232f9?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "review": "A powerful portrayal of racial injustice and moral growth in the American South. Harper Lee's masterpiece delves into the complexities of race, class, and morality, offering a searing indictment of prejudice and inequality. Through the eyes of Scout Finch, the novel explores the innocence of childhood juxtaposed with the harsh realities of bigotry and injustice. Atticus Finch emerges as a symbol of integrity and courage, challenging societal norms and advocating for justice in the face of adversity. With its timeless themes and unforgettable characters, 'To Kill a Mockingbird' remains a seminal work of American literature, inspiring readers to confront the injustices of their own time.",
    "totalPages": 324,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Social Issues", "Coming-of-Age"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960,
    "identity": "Adult"
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "nickname": "1984",
    "author": "George Orwell",
    "image": "https://img.freepik.com/free-vector/abstract-elegant-winter-book-cover_23-2148798745.jpg?w=740&t=st=1711389053~exp=1711389653~hmac=ab47220b9cb9d099fb3be3a9d897efe00fde840d087870ad43baa12b92ff9d8c",
    "review": "A dystopian masterpiece warning against totalitarianism and government surveillance. George Orwell's '1984' remains a chilling vision of a dystopian future, where individual freedom is sacrificed in the name of state control. Through the character of Winston Smith, Orwell explores the dangers of authoritarianism and the manipulation of truth for political ends. The novel's themes of surveillance, propaganda, and thought control are as relevant today as they were when it was first published. Orwell's prophetic vision serves as a stark warning against the erosion of civil liberties and the dangers of unchecked government power. '1984' is not only a gripping tale of rebellion and resistance but also a powerful critique of oppressive regimes and the human capacity for complacency in the face of tyranny.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949,
    "identity": "Adult"
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "nickname": "Catcher",
    "author": "J.D. Salinger",
    "image": "https://img.freepik.com/premium-vector/vector-abstract-elegant-nature-book-cover_807020-181.jpg?w=1380",
    "review": "A coming-of-age novel exploring teenage angst and alienation in society. J.D. Salinger's 'The Catcher in the Rye' remains a timeless exploration of adolescent disillusionment and alienation. Through the character of Holden Caulfield, Salinger captures the angst and uncertainty of youth, as Holden grapples with issues of identity, authenticity, and belonging. The novel's themes of innocence, alienation, and the loss of innocence continue to resonate with readers of all ages, making it a perennial favorite in high school and college curricula. Salinger's sharp wit and keen insight into the adolescent psyche make 'The Catcher in the Rye' a compelling and enduring portrait of teenage angst and rebellion.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Teenage", "Identity", "Rebellion"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951,
    "identity": "Adult"
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "nickname": "Prejudice",
    "author": "Jane Austen",
    "image": "https://img.freepik.com/premium-vector/cover-annual-report_33216-94.jpg?w=740",
    "review": "A timeless romance exploring social class, manners, and marriage in 19th-century England. Jane Austen's 'Pride and Prejudice' is a sparkling comedy of manners that continues to enchant readers with its wit, charm, and timeless romance. Through the spirited character of Elizabeth Bennet and the brooding Mr. Darcy, Austen explores themes of love, marriage, and social hierarchy, while also offering a witty commentary on the absurdities of Regency-era society. With its memorable characters, sharp dialogue, and timeless themes, 'Pride and Prejudice' remains a beloved classic that continues to captivate readers of all ages.",
    "totalPages": 432,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Classic Literature"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813,
    "identity": "child"
  },
  {
    "bookId": 6,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "nickname": "Philosopher's",
    "author": "J.K. Rowling",
    "image": "https://img.freepik.com/premium-vector/modern-business-brochure-template_71228-348.jpg?w=740",
    "review": "A magical adventure introducing readers to the wizarding world of Harry Potter. J.K. Rowling's 'Harry Potter and the Philosopher's Stone' is an enchanting tale of friendship, courage, and the power of magic. Through the eyes of young Harry Potter, readers are transported to the Hogwarts School of Witchcraft and Wizardry, where they embark on a thrilling journey filled with spells, potions, and mythical creatures. Rowling's imaginative storytelling and vivid world-building captivate readers of all ages, while her themes of loyalty, bravery, and the triumph of good over evil resonate on a deeper level. 'Harry Potter and the Philosopher's Stone' is not only a delightful fantasy adventure but also a timeless story of hope and resilience that continues to inspire generations of readers worldwide.",
    "totalPages": 332,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure", "Friendship"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997,
    "identity": "child"
  }
]
